{
    "changes": [
         {
            "title": "Improved video frame and quality. HELP - WebRTC diagnose.",
            "timestamp": "2025-04-25T16:33:12+0000",
            "body": "No more grey bars on the left and right side of a video frame. Check the Help menu (upper right corner) to discover a new support page including an easy automated video-conferencing test."
        },{
            "title": "Added a standard background image to the lobby.",
            "timestamp": "2025-04-04T17:08:34+0000",
            "body": "A user entering the lobby can now see a background image. Campus manager can change the image in the Campus settings and customize it for the organization. Additional improvments are made in the backend."
        },
         {
            "title": "Added display of amount of members and guests in the lobby and in favorite tabs",
            "timestamp": "2025-03-5T18:15:34+0000",
            "body": "A user entering the lobby can now see how many members and visitors are in areas. They can also use the star to set areas as favorites, which are then displayed as tabs in the header. They can also see the number of members and guests there. "
        },
        {
            "title": "Update of UI components",
            "timestamp": "2025-02-25T18:15:34+0000",
            "body": "Icons disappeared. We got them back. Added an AI widget (only visible for subscibers of Sherloq). Talk to us to learn more."
        },
        {
            "title": "Fixed a couple of language issues",
            "timestamp": "2025-01-14T17:52:23+0000",
            "body": "Added German language to several dialogue boxes. Added a second email provider to deliver magic links in case of third party outage."
        },
           {
            "title": "Fixed a couple of language issues",
            "timestamp": "2024-11-18T17:32:44+0000",
            "body": "Added messaging between visitor and host to visitor entrance."
        },
         {
            "title": "Upgrade of jitsi Version",
            "timestamp": "2024-11-15T16:25:02+0000",
            "body": "A new jitis Version allows to use Firefox as browser. It might require a reload in a call to get connected the first time. We removed the blocker. Improved image upload feature (general rule: <2MB). Visitor entrance facelift."
        }, 
        {
            "title": "Messaging between host and guest in the visitor entrance",
            "timestamp": "2024-11-12T12:09:41+0000",
            "body": "Users can now apply the messaging function to communicate with guests in the visitor entrance and vice versa."
        },  
        {
            "title": "Improved Invitation Manager",
            "timestamp": "2024-08-30T07:12:10+0000",
            "body": "Added the possibility to add individual video links to an invitation. Added standard video functionality."
        },
         {
            "title": "Creating a new CAMPUS with rooms and areas in German",
            "timestamp": "2024-07-27T19:33:52+0000",
            "body": "Campus rooms are created in German if a (new) user has choosen German as preferred language."
        },
        {
            "title": "Restrict browser usage",
            "timestamp": "2024-05-15T19:23:41+0000",
            "body": "Users applied browsers with incompatibilities. To avoid related trouble we restricted the usage to a subset to reduce issues for users."
        },  
        {
            "title": "Improved Round Table Mode of the Virtual Moderator",
            "timestamp": "2023-11-28T19:02:13+0000",
            "body": "Fixed issue: Sometimes the name of a user wasn't displayed."
        },  
        {
            "title": "Backend improvements",
            "timestamp": "2023-11-08T18:22:42+0000",
            "body": "Several improvements to optimize the system."
        },  
        {
            "title": "Added a video to the Visitor Entrance settings",
            "timestamp": "2023-10-17T18:47:30+0000",
            "body": "ivCAMPUS manager are allowed to add a general video link to the Visitor Entrance. Users can change the video in each invitation they create or apply the standard setting. The aim: shorten the waiting time for visitors."
        },  
        {
            "title": "Reactivated announcement button.",
            "timestamp": "2023-10-02T19:32:20+0000",
            "body": "Reactivated the megaphone icon for areas due to client requests."
        },  
        {
            "title": "Update of the video engine.",
            "timestamp": "2023-09-27T18:00:10+0000",
            "body": "Improved video frames order and features. Introducing emojis and gifys to send reactions. New icon to collapse room panel. All settings gathered in the wheel icon."
        },   
        {
            "title": "Improved user feedback and usability.",
            "timestamp": "2023-09-19T08:00:50+0000",
            "body": "Error messages in bulk invite improved. Changed burger menu icon to a more speaking panel illustration. Removed message to all icon (megaphone)."
        },      
        {
            "title": "Improved visibility for hosts of invited people.",
            "timestamp": "2023-09-07T08:00:50+0000",
            "body": "Notification of visitors, inviters and hosts improved. New design for messages."
        },
        {
            "title": "Improved ivCAMPUS experience!",
            "timestamp": "2023-07-11T17:30:50+0000",
            "body": "You should notice that room changes are more seamless and there is significantly less need to reload the browser page."
        },
          {
            "title": "Quick fix - allow visitors to change video background",
            "timestamp": "2023-07-11T01:10:20+0000",
            "body": "Enabled setting for visitor to change video background inside CAMPUS. This will be improved to allow a change already before entering the CAMPUS. Please stay tuned."
        },
         {
            "title": "Streamlined icon bar above video frames.",
            "timestamp": "2023-07-03T08:00:00+0000",
            "body": "Icon colors changed. The icon to set the video background has moved to 'My settings' (click your profile image)."
        },
        {
            "title": "Virtual Video-Guide - Experimental",
            "timestamp": "2023-06-30T19:30:00+0000",
            "body": "New attachment allows to add and pin a video link for lots of nice usecases. Find yours and feedback please."
        },

        {
            "title": "Billing system and trial period added.",
            "timestamp": "2023-04-27T21:00:00+0000",
            "body": "Managers can see an additional tab to manage a subscription. Please let us know if you have any question: info@ivicos.eu"
        },
             {
            "title": "Slow services and short outage.",
            "timestamp": "2023-03-13T09:40:00+0000",
            "body": "Increasing usage of ivCAMPUS required additional CPU power for our database. The provider reported that he is automatically assigning more power. But it took 15 minutes to do so. Sorry for any inconvinience..."
        },
         {
            "title": "Minor optimization update.",
            "timestamp": "2023-03-03T07:30:00+0000",
            "body": "Improvements of the design, fixing minor issues and adding the possibility to reorder attachments."
        },
        {
            "title": "Microsoft 365 outage - fixed.",
            "timestamp": "2023-01-25T09:30:00+0000",
            "body": "Microsoft and related systems are up and running after an hour of outage. Sorry for any inconvinience for trouble out of our control."
        },
        {
            "title": "Microsoft 365 outage.",
            "timestamp": "2023-01-25T09:30:00+0000",
            "body": "Serious Internet Trouble - please stay tuned."
        },
         {
            "title": "Happy New Year.",
            "timestamp": "2023-01-04T11:30:00+0000",
            "body": "We are further working on improvements to provide a great user experience. Minor improvements deployed end of December 2022. Please let us know if you have comments, requests or ideas."
        },
        {
            "title": "We updated ivCAMPUS.",
            "timestamp": "2022-12-08T23:30:00+0000",
            "body": "New authentification system (magic link). Multi-language support, Guest notification sound, Improved member invitation, Refresh button, lots of minor improvements."
        },
          {
            "title": "We updated several services to improve stability.",
            "timestamp": "2022-11-08T12:20:00+0000",
            "body": "However: Firefox and Safari updates still cause some trouble. We recommend Chrome, Edge or Brave."
        },
          {
            "title": "A domain name change led to a short outage for the first time.",
            "timestamp": "2022-09-27T12:20:00+0000",
            "body": "The internet is a complex system. We know it from other large systems - one wrong value can impact the whole network. We're sorry."
        },
        {
            "title": "New feature: Visitor entrance",
            "timestamp": "2022-05-09T12:00:00+0000",
            "body": "You'll enjoy: a new visitor management - including direct links and a customization of the visitor entrance."
        },
         {
            "title": "New jitsi version deployed",
            "timestamp": "2021-11-18T19:15:43+0000",
            "body": "You'll enjoy: improved video and audio performance, sticky backgrounds, new screensharing features, etc."
        },
        {
            "title": "New features deployed",
            "timestamp": "2021-10-28T17:55:43+0000",
            "body": "You'll enjoy: improved profile settings, improved usability, (e.g. enter a public room with a double click), edit attachment names, improved responsiveness, easier onboarding."
        },
        {
            "title": "First entry",
            "timestamp": "2021-08-11T15:08:43+0000",
            "body": "Testing out a new changelog format"
        }
    ]
}
